app/views/shared/_brewers.html.erb

SELECT "for_brewers".* FROM "for_brewers" ORDER BY position ASC
---
<% brewers = ForBrewer.order("position ASC")%>