app/views/shared/_retailers.html.erb

SELECT "for_retailers".* FROM "for_retailers" ORDER BY position ASC
---
<% retailers = ForRetailer.order("position ASC")%>