app/controllers/pages_controller.rb

  def home
    error_404 unless (@page = Page.find_by_link_url("/", :include => [:parts, :slugs])).present?
---
SELECT "page_parts".* FROM "page_parts" WHERE ("page_parts".page_id IN (3,14,15,25,16,11,17,8,18,31,12,27,26,13,4)) ORDER BY position ASC
SELECT "pages".* FROM "pages" WHERE ("pages"."link_url" = '/') LIMIT 1

  def show
    @page = if params[:path]
      Page.find(params[:path].split('/').last, :include => [:parts, :slugs])
---
SELECT "page_parts".* FROM "page_parts" WHERE ("page_parts".page_id IN (3,14,15,25,16,11,17,8,18,31,12,27,26,13,4)) ORDER BY position ASC
SELECT "pages".* FROM "pages" WHERE ("pages"."id" = 0) LIMIT 1
SELECT "slugs".* FROM "slugs" WHERE ("slugs".sluggable_id = 25 AND "slugs".sluggable_type = 'Page') ORDER BY id DESC LIMIT 1